
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/19474908662)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_pages_project.homepage


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_pages_project.homepage will be updated in-place
  ~ resource "cloudflare_pages_project" "homepage" {
      ~ canonical_deployment   = {
          ~ aliases            = [
              - "https://clov3r.cc",
              - "https://www.clov3r.cc",
            ] -> (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-11-17T15:35:47Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  + commit_hash    = (known after apply)
                  + commit_message = (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "4e3eabf8-3a90-4f26-a481-18dbcbad8d24" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-11-17T15:35:54Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-11-17T15:35:54Z" -> (known after apply)
          ~ project_id         = "f9e9ebc0-fd49-433a-9d6c-ecf93d800066" -> (known after apply)
          ~ project_name       = "my-home" -> (known after apply)
          ~ short_id           = "4e3eabf8" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-11-17T15:35:47Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-11-17T15:35:54Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://4e3eabf8.my-home.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ created_on             = "2025-10-25T06:51:55Z" -> (known after apply)
      ~ deployment_configs     = {
          ~ preview    = {
              ~ compatibility_date                   = "2025-10-25" -> (known after apply)
              ~ compatibility_flags                  = [] -> (known after apply)
                # (4 unchanged attributes hidden)
            }
          ~ production = {
              ~ compatibility_date                   = "2025-11-17" -> "2025-09-15"
              ~ compatibility_flags                  = [] -> (known after apply)
                # (4 unchanged attributes hidden)
            }
        }
      ~ domains                = [
          - "my-home.pages.dev",
          - "clov3r.cc",
          - "www.clov3r.cc",
        ] -> (known after apply)
      ~ framework              = null -> (known after apply)
      ~ framework_version      = null -> (known after apply)
        id                     = "my-home"
      ~ latest_deployment      = {
          ~ aliases            = [
              - "https://clov3r.cc",
              - "https://www.clov3r.cc",
            ] -> (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-11-17T15:35:47Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  + commit_hash    = (known after apply)
                  + commit_message = (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "4e3eabf8-3a90-4f26-a481-18dbcbad8d24" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-11-17T15:35:54Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-11-17T15:35:54Z" -> (known after apply)
          ~ project_id         = "f9e9ebc0-fd49-433a-9d6c-ecf93d800066" -> (known after apply)
          ~ project_name       = "my-home" -> (known after apply)
          ~ short_id           = "4e3eabf8" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-11-17T15:35:47Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-11-17T15:35:54Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://4e3eabf8.my-home.pages.dev" -> (known after apply)
        } -> (known after apply)
        name                   = "my-home"
      ~ preview_script_name    = "pages-worker--8681396-preview" -> (known after apply)
      ~ production_script_name = "pages-worker--8681396-production" -> (known after apply)
      + source                 = (known after apply)
      ~ subdomain              = "my-home.pages.dev" -> (known after apply)
      ~ uses_functions         = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":165,"Program":"tfcmt","SHA1":"8b20ef0860c0260d0c48dc65cd5be078843d753d","Vars":{},"WorkflowName":"Terraform CI"} -->